In [1]:
# Ddd dependencies
import pandas as pd

from sqlalchemy import create_engine
from sqlalchemy.orm import Session
from sqlalchemy.ext.declarative import declarative_base
Base = declarative_base()

from sqlalchemy import Column, Integer, String, Float, Date

In [2]:
# Load csv files
coordinate_data = 'raw_data/statelatlong.csv'
test_data = 'test_data/test_data.csv'
clean_data_ec ='clean_data\clean_data_ec_2013_to_2017.csv'
clean_data_ne ='clean_data\clean_data_ne_2013_to_2017.csv'
clean_data_s ='clean_data\clean_data_s_2013_to_2017.csv'
clean_data_se ='clean_data\clean_data_se_2013_to_2017.csv'
clean_data_sw ='clean_data\clean_data_sw_2013_to_2017.csv'
clean_data_wc ='clean_data\clean_data_wc_2013_to_2017.csv'
clean_data_p ='clean_data\clean_data_p_2013_to_2017.csv'
div_data ='raw_data/nielsen_division.csv'

In [3]:
# Read Data File and store into Pandas Data Frames
coordinate_df = pd.read_csv(coordinate_data)
test_df = pd.read_csv(test_data)
clean_df_ec = pd.read_csv(clean_data_ec)
clean_df_ne = pd.read_csv(clean_data_ne)
clean_df_s = pd.read_csv(clean_data_s)
clean_df_se = pd.read_csv(clean_data_se)
clean_df_sw = pd.read_csv(clean_data_sw)
clean_df_wc = pd.read_csv(clean_data_wc)
clean_df_p = pd.read_csv(clean_data_p)
div_df = pd.read_csv(div_data)

In [4]:
coordinate_df.head()

  abbreviation   Latitude   Longitude       state
0           AL  32.601011  -86.680736     Alabama
1           AK  61.302501 -158.775020      Alaska
2           AZ  34.168219 -111.930907     Arizona
3           AR  34.751928  -92.131378    Arkansas
4           CA  37.271875 -119.270415  California

In [5]:
test_df.head()

   index category gender    age  year      division  population
0      0   totals   Male  18-24  2013  east_central          27
1      0   totals   Male  18-24  2013  east_central          31
2      0   totals   Male  18-24  2013  east_central          55
3      0   totals   Male  18-24  2013  east_central          78
4      0   totals   Male  18-24  2014  east_central          54

In [6]:
clean_df_ec.head()

  category gender    age  year      division  population
0   totals   Male  18-24  2013  east_central          31
1   totals   Male  25-34  2013  east_central          51
2   totals   Male  35-44  2013  east_central          71
3   totals   Male  45-54  2013  east_central          64
4   totals   Male    55+  2013  east_central          78

In [7]:
div_df.head()

        state    division
0     Alabama  south_east
1      Alaska     pacific
2     Arizona    mountain
3    Arkansas  south_west
4  California     pacific

In [8]:
# Create the class   
class Coordiate_table(Base):
    __tablename__ = 'coordinate_table'
    index = Column(Integer, primary_key = True)
    State = Column(String(255))
    Latitude = Column(Integer)
    Longitude = Column(Integer)
    City = Column(String(255))
    
class Test1_table(Base):
    __tablename__ = 'test_table'
    index = Column(Integer, primary_key = True)
    category = Column(String(255))
    gender = Column(String(255))
    age = Column(String(255))
    year = Column(Integer)
    region = Column(String(255))
    population = Column(Float)   
    
class East_Central_table(Base):
    __tablename__ = 'east_central_table'
    index = Column(Integer, primary_key = True)
    category = Column(String(255))
    gender = Column(String(255))
    age = Column(String(255))
    year = Column(Integer)
    division = Column(String(255))
    population = Column(Float) 

class North_East_table(Base):
    __tablename__ = 'north_east_table'
    index = Column(Integer, primary_key = True)
    category = Column(String(255))
    gender = Column(String(255))
    age = Column(String(255))
    year = Column(Integer)
    division = Column(String(255))
    population = Column(Float) 
    
class Pacific_table(Base):
    __tablename__ = 'pacific_table'
    index = Column(Integer, primary_key = True)
    category = Column(String(255))
    gender = Column(String(255))
    age = Column(String(255))
    year = Column(Integer)
    division = Column(String(255))
    population = Column(Float) 
    
class South_table(Base):
    __tablename__ = 'south_table'
    index = Column(Integer, primary_key = True)
    category = Column(String(255))
    gender = Column(String(255))
    age = Column(String(255))
    year = Column(Integer)
    division = Column(String(255))
    population = Column(Float) 
    
class South_East_table(Base):
    __tablename__ = 'south_east_table'
    index = Column(Integer, primary_key = True)
    category = Column(String(255))
    gender = Column(String(255))
    age = Column(String(255))
    year = Column(Integer)
    division = Column(String(255))
    population = Column(Float) 
    
class South_West_table(Base):
    __tablename__ = 'south_west_table'
    index = Column(Integer, primary_key = True)
    category = Column(String(255))
    gender = Column(String(255))
    age = Column(String(255))
    year = Column(Integer)
    division = Column(String(255))
    population = Column(Float) 
    
class West_Central_table(Base):
    __tablename__ = 'west_central_table'
    index = Column(Integer, primary_key = True)
    category = Column(String(255))
    gender = Column(String(255))
    age = Column(String(255))
    year = Column(Integer)
    division = Column(String(255))
    population = Column(Float) 
    
class Nielsen_Division_table(Base):
    __tablename__ = 'nielsen_division_table'
    index = Column(Integer, primary_key = True)
    state = Column(String(255))
    division = Column(String(255))

In [9]:
# Create the datbase and add the classes
engine = create_engine("sqlite:///database.sqlite", echo = False)
conn = engine.connect()
session = Session(engine)

Base.metadata.create_all(conn)

In [10]:
# Send the station dataframe to the sqlite database
coordinate_df.to_sql('coordinate_table', engine, if_exists='replace')
test_df.to_sql('test_table', engine, if_exists='replace')
clean_df_ec.to_sql('east_central_table', engine, if_exists='replace')
clean_df_ne.to_sql('north_east_table', engine, if_exists='replace')
clean_df_p.to_sql('pacific_table', engine, if_exists='replace')
clean_df_s.to_sql('south_table', engine, if_exists='replace')
clean_df_se.to_sql('south_east_table', engine, if_exists='replace')
clean_df_sw.to_sql('south_west_table', engine, if_exists='replace')
clean_df_wc.to_sql('west_central_table', engine, if_exists='replace')
div_df.to_sql('nielsen_division_table', engine, if_exists='replace')